Repository: bittin/cozy
Catalog: po/extra/*.po
Languages: pl

source: Audio Book Player
pl: Odtwarzacz Audiobooków

source: Play and organize your audio book collection
pl: Odtwarzaj i organizuj swoją kolekcję książek audio

source: Listen to audio books
pl: Słuchaj audiobooków

source: Do you like audio books? Then lets get cozy!
pl: Lubisz audiobooki? W takim razie przytulmy się!

source: Cozy is a audio book player. Here are some of the features:
pl: Cozy to odtwarzacz książek audio. Oto niektóre z jego funkcji:

source: Import all your audio books into Cozy to browse them comfortably
pl: Importuj wszystkie swoje książki audio do Cozy, aby wygodnie je przeglądać

source: Listen to your DRM free mp3, m4b, m4a (aac, ALAC, …), flac, ogg and wav audio books
pl: Słuchaj swoich książek audio bez DRM w formatach mp3, m4b, m4a (aac, ALAC, ...), flac, ogg i wav

source: Remembers your playback position
pl: Zapamiętuje pozycję odtwarzania

source: Sleep timer
pl: Minutnik uśpienia

source: Playback speed control for each book individually
pl: Kontrola prędkości odtwarzania dla każdej książki z osobna

source: Search your library
pl: Szukaj w bibliotece

source: Multiple storage location support
pl: Obsługa wielu lokalizacji przechowywania

source: Offline Mode! This allows you to keep an audio book on your internal storage if you store your audio books on an external or network drive. Perfect to listen to on the go!
pl: Tryb Offline! Dzięki temu możesz zachować książkę audio na wewnętrznej pamięci masowej, jeśli przechowujesz książki audio na dysku zewnętrznym lub sieciowym. Idealny do słuchania w podróży!

source: Drag and Drop to import new audio books
pl: Przeciągnij i upuść, aby zaimportować nowe audiobooki

source: Sort your audio books by author, reader and name
pl: Sortuj swoje książki audio według autora, lektora i nazwiska

source: This release features a redesigned preference window. All settings can now be searched. Good news for mobile users too: the redesign should work a lot better on mobile devices now.
pl: To wydanie zawiera przeprojektowane okno preferencji. Wszystkie ustawienia można teraz przeszukiwać. Dobra wiadomość także dla użytkowników urządzeń mobilnych: przeprojektowane okno preferencji powinno teraz działać znacznie lepiej na urządzeniach mobilnych.

source: Redesigned preference window
pl: Przeprojektowane okno preferencji

source: Preferences can now be searched
pl: Można teraz przeszukiwać preferencje

source: Fix: position slider did not update the time correctly after an import scan
pl: Poprawka: suwak pozycji nie aktualizował poprawnie czasu po skanowaniu importu

source: Fix: after an import scan the library did not display the currently playing book correctly
pl: Poprawka: po skanowaniu importu biblioteka nie wyświetlała poprawnie aktualnie odtwarzanej książki

source: As always, updated translations thanks to all of the translators!
pl: Jak zawsze, zaktualizowane tłumaczenia dzięki wszystkim tłumaczom!

source: A small bugfix release which makes Cozy more reliable.
pl: Mała poprawka błędów, która sprawia, że Cozy jest bardziej niezawodny.

source: Fresh playback speed and sleep timer icons (thanks jimmac)
pl: Nowe ikony prędkości odtwarzania i licznika czasu uśpienia (dzięki jimmac)

source: Refreshing the library now uses a more descriptive text (thanks jubalh)
pl: Odświeżanie biblioteki używa teraz bardziej opisowego tekstu (dzięki jubalh)

source: Multiple small bug fixes
pl: Wiele poprawek drobnych błędów

source: Display an error banner if an error occurs while importing new files
pl: Wyświetl baner błędu, jeśli wystąpi błąd podczas importowania nowych plików

source: The audiobook directory selector in the empty state has been replaced by a button to allow a narrow window even with long directory names
pl: Selektor katalogu audiobooków w stanie pustym został zastąpiony przyciskiem, aby umożliwić wąskie okno nawet przy długich nazwach katalogów

source: Fix: multiple small UI issues
pl: Poprawka: wiele drobnych problemów z interfejsem użytkownika

source: Fix: the welcome screen now works properly on a mobile device
pl: Poprawka: ekran powitalny działa teraz poprawnie na urządzeniach mobilnych

source: Fix: don't display the mobile library switcher when no files are imported
pl: Poprawka: nie wyświetlaj przełącznika biblioteki mobilnej, gdy nie są importowane żadne pliki

source: Fix: in the book detail view the pause icon for a chapter remained even when the next chapter already started playing
pl: Poprawka: w widoku szczegółów książki ikona pauzy dla rozdziału pozostawała nawet wtedy, gdy następny rozdział był już odtwarzany.

source: This release features a redesigned library with responsiveness in mind.
pl: To wydanie zawiera przeprojektowaną bibliotekę z myślą o responsywności.

source: Redesigned library
pl: Przeprojektowanie biblioteki

source: Redesigned start screen
pl: Przeprojektowany ekran startowy

source: Redesigned book detail screen
pl: Przeprojektowany ekran szczegółów książki

source: Responsive design for the main window
pl: Responsywny design dla głównego okna

source: Introducing a welcome screen for new installations
pl: Wprowadzenie ekranu powitalnego dla nowych instalacji

source: Fix: a rare bug where Cozy's volume was muted at first start
pl: Poprawka: rzadki błąd, w którym głośność Cozy'ego była wyciszona przy pierwszym uruchomieniu

source: Fix: long book names or author names will be truncated properly
pl: Poprawka: długie nazwy książek lub nazwiska autorów zostaną prawidłowo obcinane

source: Performance improvements for the book detail view and some bugfixes.
pl: Poprawki wydajności dla widoku szczegółów książki i kilka poprawek błędów.

source: Chapters in the book detail view will now be loaded lazily (thanks chris-kobrzak!)
pl: Rozdziały w widoku szczegółów książki będą teraz ładowane leniwie (dzięki Chris-kobrzak!)

source: Books with a single chapter don't display a chapter number anymore (thanks chris-kobrzak!)
pl: Książki z jednym rozdziałem nie wyświetlają już numeru rozdziału (dzięki chris-kobrzak!)

source: Fix: Locals in What's new in Cozy screen (thanks alyssais!)
pl: Naprawić: Lokalizacje na ekranie Co nowego w Cozy (dzięki alyssais!)

source: Fix: Catch an error that could occur when a book stops
pl: Poprawka: Wykrycie błędu, który mógł wystąpić, gdy książka się zatrzyma

source: Small performance improvements
pl: Niewielkie poprawki wydajności

source: When an issue occurs during playback the error message is displayed to the user
pl: W przypadku wystąpienia problemu podczas odtwarzania użytkownikowi wyświetlany jest komunikat o błędzie

source: Fix: Importing media without tags now properly decodes the file name as chapter name (thanks chris-kobrzak!)
pl: Poprawka: Importowanie multimediów bez tagów teraz poprawnie dekoduje nazwę pliku jako nazwę rozdziału (dzięki Chris-kobrzak!)

source: Fix: Ensure that always a default storage location is present
pl: Poprawka: Upewnij się, że zawsze obecna jest domyślna lokalizacja przechowywania

source: Fix: During import an error could occur which stopped the import
pl: Poprawka: Podczas importu mógł wystąpić błąd, który zatrzymywał import

source: Fix: During the database migration an error could occur
pl: Poprawka: Podczas migracji bazy danych mógł wystąpić błąd

source: When copying files to the audiobook library goes wrong, the user is now informed with the error
pl: Gdy kopiowanie plików do biblioteki audiobooków nie powiedzie się, użytkownik jest teraz informowany o błędzie

source: Fix: Possible error while displaying offline cache copy progress
pl: Poprawka: Możliwy błąd podczas wyświetlania postępu kopiowania pamięci podręcznej w trybie offline

source: Fix: When changing the audiobook location or selecting a file in the file not found dialog an unexpected error could occur
pl: Poprawka: Podczas zmiany lokalizacji audiobooka lub wyboru pliku w oknie dialogowym nie znaleziono pliku mógł wystąpić nieoczekiwany błąd.

source: Fix: Removing a storage dir in settings did not work
pl: Poprawka: Usunięcie katalogu pamięci w ustawieniach nie działało

source: Fix: Removing a book from the library did sometimes not work
pl: Poprawka: Usunięcie książki z biblioteki czasami nie działało

source: This release features chapter support for m4b files.
pl: To wydanie zawiera obsługę rozdziałów dla plików m4b.

source: A long awaited feature has finally arrived: Chapter support for m4b files.
pl: Wreszcie pojawiła się długo oczekiwana funkcja: Obsługa rozdziałów dla plików m4b.

source: Books with inconsistent spelling are now grouped into a single book (thanks chris-kobrzak!).
pl: Książki z niespójną pisownią są teraz zgrupowane w jedną księgę (dzięki Chris-kobrzak!).

source: Improved reliability of restoring the previous playback position.
pl: Poprawiona niezawodność przywracania poprzedniej pozycji odtwarzania.

source: Fix: clicking on a currently playing chapter did not pause the chapter as expected.
pl: Poprawka: kliknięcie na aktualnie odtwarzanym rozdziale nie powodowało wstrzymania odtwarzania rozdziału zgodnie z oczekiwaniami.
